MMAProgram/pitzDaily_2/system/decomposeParDict

// * * * * * * * * * //
FoamFile
{
	version 0.5;
	format ascii;
	root "ROOT";
	case "CASE";
	class dictionary;
	object nix;
}

method          simple;
numberOfSubdomains  8;
coeffs
{
    n   (4 2 1);
}